perftest/quick_test.txt
Running 5s test @ http://localhost:3001/health
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    38.17us   19.73us 314.00us   77.51%
    Req/Sec   112.23k     7.07k  120.13k    85.29%
  Latency Distribution
     50%   34.00us
     75%   47.00us
     90%   61.00us
     99%  110.00us
  1138526 requests in 5.10s, 212.81MB read
Requests/sec: 223240.70
Transfer/sec:     41.73MB